Revit 2024 API
DocumentDifference.GetCreatedElementIds Method
 Created element id collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ISet<ElementId> GetCreatedElementIds()
Visual Basic
Public Function GetCreatedElementIds As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetCreatedElementIds()
See Also
DocumentDifference Class
Autodesk.Revit.DB Namespace